//Вариант 9. Катаев Степан РИС-26-3б
#include <iostream>
using namespace std;
#include <locale>

int main()
{
    setlocale(LC_ALL, ".65001");//Подключаем русский язык
    int n,m;//Выделяем место для переменных
    cout << "Введите два числа n и m: " << endl;
    cin >> n >> m;//Вводим переменные
    cout << "1) " << (++n*++m) << endl;//сначала n и m увеличиваются на 1, после находится их произведение
    cout << "2) " << (m++<n) << endl;//если m меньше n тогда 1, иначе 0. Потом m увеличивается на 1 
    cout << "3) " << (n++>m) << endl;//если n больше m тогда 1, иначе 0. Потом n увеличивается на 1
    return 0;
}