#include <iostream> //подключаем библиотеку для управления вводом / выводом
#include <clocale> //подключаем библиотеку для локализации
using namespace std; //подключаем пространство имён std

int main()
{
    setlocale(LC_ALL, ".65001"); // подключаем русскую локализацию
    const long double b = 0.0001; //инициализируем b - точность
    long double a = 10; //инициализируем a{1} = 10^1 / 1!
    long double s = 0; //инициализируем s - сумма
    int n = 1; //инициализируем n - номер элемента
    while (a >= b)//начало цикла
    {
        s += a; //суммируем
        ++n;//изменяем номер
        a = a * ((long double)10 / n); // a{n+1} = a{n} * 10 / (n+1)
    }
    cout << "Вариант 9, выполнил Катаев Степан РИС-26-3Б" << endl;
    cout << "Сумма ряда с 1 по "<< n - 1 <<", которые удволетворяют заданной точности, равна: " << s << endl; //выводим результат работы программы
    return 0;//возвращаем 0, как результат верного выполнения блока main()
}